<template>
    <x-popover
        title="梦游天姥吟留别"
        max-height="100"
    >
        <x-button dashed type="warning">最大高度</x-button>
        <template #content>
            <p>[唐] 李白</p>
            <p>海客谈瀛洲，烟涛微茫信难求。</p>
            <p>越人语天姥，云霞明灭或可睹。</p>
            <p>天姥连天向天横，势拔五岳掩赤城。</p>
            <p>天台一万八千丈，对此欲倒东南倾。</p>
            <p>我欲因之梦吴越，一夜飞度镜湖月。</p>
            <p>湖月照我影，送我至剡溪。</p>
            <p>谢公宿处今尚在，渌水荡漾清猿啼。</p>
            <p>脚著谢公屐，身登青云梯。</p>
            <p>半壁见海日，空中闻天鸡。</p>
            <p>千岩万转路不定，迷花倚石忽已暝。</p>
            <p>熊咆龙吟殷岩泉，栗深林兮惊层巅。</p>
            <p>云青青兮欲雨，水澹澹兮生烟。</p>
            <p>列缺霹雳，丘峦崩摧。洞天石扉，訇然中开。</p>
            <p>青冥浩荡不见底，日月照耀金银台。</p>
            <p>霓为衣兮风为马，云之君兮纷纷而来下。</p>
            <p>虎鼓瑟兮鸾回车，仙之人兮列如麻。</p>
            <p>忽魂悸以魄动，恍惊起而长嗟。</p>
            <p>惟觉时之枕席，失向来之烟霞。</p>
            <p>世间行乐亦如此，古来万事东流水。</p>
            <p>别君去兮何时还，且放白鹿青崖间，</p>
            <p>须行即骑访名山。安能摧眉折腰事权贵，</p>
            <p>使我不得开心颜。</p>
        </template>
    </x-popover>
</template>